---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures
source: html/488fea20-610c-c1f2-f3dc-0ea56966e892.htm
---
# BuiltInFailures.SlabShapeFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.